---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.EntitlementExternalService
source: html/8a28bc7a-11cd-7ca5-c207-6b0c1dd00c93.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.EntitlementExternalService Property

The external service which supports get entitlement information.

## Syntax (C#)
```csharp
public static ExternalServiceId EntitlementExternalService { get; }
```